# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

day = input('Введите день недели (1-7)')
if day == '1':
    print('Понедельник')
elif day == '2':
    print('Вторник')
elif day == '3':
    print('Среда')
elif day == '2':
    print('Вторник')
elif day == '2':
    print('Вторник')
elif day == '2':
    print('Вторник')
elif day == '2':
    print('Вторник')

    case _: print('Такого дня недели нет')